title_text_0: "Hello, World!";
title_text_1: "Second title!";
title_text_2: "The game.";
title_text_3: "Optimization is hurting me.";
title_text_4: "Something strange...";
title_text_5: "Random title.";
title_text_6: "A cat. =￣ω￣=";
title_text_7: "Why you're looking at it?";
title_text_8: "I hate text fields.";
title_text_9: "Go out and touch grass.";

generate_load: "World loading.";
generate_biome: "Biomes generating.";
generate_base: "Base world generating.";
generate_smooth: "World smoothing.";
generate_small_caves: "Small caves generating.";
generate_big_caves: "Big caves generating.";
generate_gigantic_caves: "Gigantic caves generating";
generate_special_caves: "Special caves generating.";
generate_ground: "Ground tiles placing.";
generate_trees: "Trees placing.";
generate_small_smooth_ground: "Ground small smothing.";
generate_small_smooth_walls: "Walls small smothing.";
generate_structures: "Structures generating.";

play: "Play";

game_load: "Load Game";
game_new: "New Game";
seed: "Seed";
name: "Name";
create_world: "Create world";

invalid_world_name: "Invalid world name!";
invalid_world_seed: "Invalid world seed!";
world_available: "World is already available!"; 

pause: "Pause";

graphics: "Graphics";
settings: "Settings";
back: "Back";

structure_editor: "Structure Editor";

show_only_walls: "Show only walls";
make_tile_triangle: "Make tile triangle";
change_tile_type: "Change tile type";
width: "Width";
height: "Height";

apply: "Apply";
import: "Import";
export: "Export";
exit: "Exit";

grass: "Grass";
grass_description: "A lush, green lawn.";

dirt: "Dirt";
dirt_description: "Loose, earthen soil.";

stone: "Stone";
stone_description: "A rough, natural stone.";

oak_wood: "Oak Wood";
oak_wood_description: "A sturdy, wooden plank.";

deep_stone: "Deep Stone";
deep_stone_description: "A dense, dark flake stone with a hint of celestial blue.";
